<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b9c7f10ef86a7ccdab0e3235dd57f400c13db84af99023a2cfbba99d479b5279","plan_job_ref":"Job Test plan target and replace #353 at https://github.com/dflook/terraform-github-actions/actions/runs/5609975691","plan_hash":"21db26cb86de086362ebbf347246decf2a47ce458b03ef65e968f74e462427ef","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "eSZ6OWf7Jk" -> (known after apply)
  ~ foreach = "SRpJlQlvGu" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #353](https://github.com/dflook/terraform-github-actions/actions/runs/5609975691)